БухЭксп/ChartsOfCharacteristicTypes/CW_РеестрыНДС0ЯчейкиПриложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>CW_РеестрыНДС0ЯчейкиПриложений</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>16</v8:Digits>
					<v8:FractionDigits>2</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>150</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяЯчейки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаНалоговаяБаза</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаНумерации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеПоВидуТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеестрыНДС0Приложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяДополнительныеСтроки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПримечание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

БухЭксп/Enums/CW_РеестрыНДС0Приложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_РеестрыНДС0Приложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЖД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АВТО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АВИА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МОРЕ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖДПредоставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АВИАТранзит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖДТранзит</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/ChartsOfCharacteristicTypes/CW_РеестрыНДС0ЯчейкиПриложений/Ext/ManagerModule.bsl
Процедура ОбновитьИменаЯчееекПриложений(Знач ПриказФНС = Неопределено) Экспорт
	
	//Приказ ФНС России от 23.10.2020 №ЕД-7-15/772@ 
	Если ПриказФНС = Неопределено ИЛИ ПриказФНС = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2 Тогда   
		
		ТекущийПриказФНС = ПриказФНС;
		Если ТекущийПриказФНС = Неопределено Тогда
			ТекущийПриказФНС = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2;
		КонецЕсли;
		
		ПриказОбъект = ТекущийПриказФНС.ПолучитьОбъект();
		ПриказОбъект.ДатаНачала = Дата(2021, 4, 1);
		ПриказОбъект.Записать();
		
		//Приложение 7    
		ЗаполнитьЯчейкиПриложения07_РеестрНДС2021Кв2();
		
		//Приложение 8    
		ЗаполнитьЯчейкиПриложения08_РеестрНДС2021Кв2();	
		
		//Приложение 9    
		ЗаполнитьЯчейкиПриложения09_РеестрНДС2021Кв2();	     
		
		//Приложение 10    
		ЗаполнитьЯчейкиПриложения10_РеестрНДС2021Кв2();  
		
		ЗаполнитьВидТранспортаДляПриложений(ТекущийПриказФНС);  
		
	КонецЕсли; 
	//Приказ ФНС России от 23.10.2020 №ЕД-7-15/772@ 
	
	//Приказ ФНС России от 14.03.2024 № ЕД-7-15/202@
	Если ПриказФНС = Неопределено ИЛИ ПриказФНС = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2 Тогда 

		//Закрываем старый приказ
		ПриказСтарыйСсылка = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2;
		ПриказСтарыйОбъект = ПриказСтарыйСсылка.ПолучитьОбъект();
		ПриказСтарыйОбъект.ДатаОкончания = Дата(2024, 6, 30);
		ПриказСтарыйОбъект.Записать();
		//Закрываем старый приказ  
		
		ТекущийПриказФНС = ПриказФНС;
		Если ТекущийПриказФНС = Неопределено Тогда
			ТекущийПриказФНС = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2;	
		КонецЕсли;
		
		ПриказОбъект = ТекущийПриказФНС.ПолучитьОбъект();
		ПриказОбъект.ДатаНачала = Дата(2024, 7, 1);
		ПриказОбъект.Записать();  
		
		//Приложение 6    
		ЗаполнитьЯчейкиРеестрНДС2024Кв2КНД_1155112();

		//Приложение 7    
		ЗаполнитьЯчейкиРеестрНДС2024Кв2КНД_1155113();
		
		//Приложение 8    
		ЗаполнитьЯчейкиРеестрНДС2024Кв2КНД_1155114();	
		
		//Приложение 9    
		ЗаполнитьЯчейкиРеестрНДС2024Кв2КНД_1155115();	
		
		//Приложение 10    
		ЗаполнитьЯчейкиРеестрНДС2024Кв2КНД_1155122();	
	
		//Приложение 11    
		ЗаполнитьЯчейкиРеестрНДС2024Кв2КНД_1155123();	
		
		//Приложение 12    
		ЗаполнитьЯчейкиРеестрНДС2024Кв2КНД_1155116();	
		
		ЗаполнитьВидТранспортаДляПриложений(ТекущийПриказФНС);
	
	КонецЕсли;
	//Приказ ФНС России от 14.03.2024 № ЕД-7-15/202@  
	
	//Приказ ФНС России от 15.11.2024 №ЕД-7-15/1036@
	Если ПриказФНС = Неопределено ИЛИ ПриказФНС = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2 Тогда 
		
		ТекущийПриказФНС = ПриказФНС;
		Если ТекущийПриказФНС = Неопределено Тогда
			ТекущийПриказФНС = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2;	
		КонецЕсли;
		
		ПриказОбъект = ТекущийПриказФНС.ПолучитьОбъект();
		ПриказОбъект.ДатаНачала = Дата(2025, 4, 1);
		ПриказОбъект.Записать();  
		
		//Приложение 7    
		ЗаполнитьЯчейкиРеестрНДС2025Кв2КНД_1155112();
		
		ЗаполнитьВидТранспортаДляПриложений(ТекущийПриказФНС);
		
	КонецЕсли;
	//Приказ ФНС России от 14.03.2024 № ЕД-7-15/202@ 	

	//Приказ ФНС России от 15.11.2024 №ЕД-7-15/1035@
	Если ПриказФНС = Неопределено ИЛИ ПриказФНС = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_ЕД715_1035 Тогда 

		ТекущийПриказФНС = ПриказФНС;
		Если ТекущийПриказФНС = Неопределено Тогда
			ТекущийПриказФНС = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_ЕД715_1035;	
		КонецЕсли;
		
		ПриказОбъект = ТекущийПриказФНС.ПолучитьОбъект();
		ПриказОбъект.ДатаНачала = Дата(2025, 4, 1);
		ПриказОбъект.Записать();  
		
		//Приложение 7    
		ЗаполнитьЯчейкиРеестрНДС2025Кв2_ЕД715_1035КНД_1155113();
		
		//Приложение 8    
		ЗаполнитьЯчейкиРеестрНДС2025Кв2_ЕД715_1035КНД_1155114();	
		
		//Приложение 9    
		ЗаполнитьЯчейкиРеестрНДС2025Кв2_ЕД715_1035КНД_1155115();	
		
	КонецЕсли;
	//Приказ ФНС России от 15.11.2024 №ЕД-7-15/1035@  
	
КонецПроцедуры   

Процедура ЗаполнитьВидТранспортаДляПриложений(ПриказФНС = Неопределено) Экспорт  
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение07, Перечисления.CW_РеестрыНДС0Приложения.ЖД);
	Соответствие.Вставить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение08, Перечисления.CW_РеестрыНДС0Приложения.АВТО);
	Соответствие.Вставить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение09, Перечисления.CW_РеестрыНДС0Приложения.АВИА);
	Соответствие.Вставить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение10, Перечисления.CW_РеестрыНДС0Приложения.МОРЕ);
	
	Соответствие.Вставить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение06, Перечисления.CW_РеестрыНДС0Приложения.ЖД);
	Соответствие.Вставить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение07, Перечисления.CW_РеестрыНДС0Приложения.АВТО);
	Соответствие.Вставить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение08, Перечисления.CW_РеестрыНДС0Приложения.АВИА);
	Соответствие.Вставить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение09, Перечисления.CW_РеестрыНДС0Приложения.МОРЕ);
	Соответствие.Вставить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение10, Перечисления.CW_РеестрыНДС0Приложения.ЖДПредоставление);
	Соответствие.Вставить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение11, Перечисления.CW_РеестрыНДС0Приложения.АВИАТранзит);
	Соответствие.Вставить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение12, Перечисления.CW_РеестрыНДС0Приложения.ЖДТранзит);
	
	Соответствие.Вставить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение06, Перечисления.CW_РеестрыНДС0Приложения.ЖД);

	Соответствие.Вставить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение07, Перечисления.CW_РеестрыНДС0Приложения.АВТО);
	Соответствие.Вставить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение08, Перечисления.CW_РеестрыНДС0Приложения.АВИА);
	Соответствие.Вставить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение09, Перечисления.CW_РеестрыНДС0Приложения.МОРЕ);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_РеестрыНДС0ЯчейкиПриложений.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений КАК CW_РеестрыНДС0ЯчейкиПриложений
	|ГДЕ
	|	CW_РеестрыНДС0ЯчейкиПриложений.ЭтоГруппа = Истина
	|   //УСЛОВИЕ_ПриказФНС";
	
	
	Если ПриказФНС = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ_ПриказФНС", "И CW_РеестрыНДС0ЯчейкиПриложений.Родитель <> Значение(ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.ПустаяСсылка)");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ_ПриказФНС", "И CW_РеестрыНДС0ЯчейкиПриложений.Родитель = &ПриказФНС");  
		
		Запрос.УстановитьПараметр("ПриказФНС", ПриказФНС);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПВХОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПВХОбъект.ПриложениеПоВидуТранспорта = Соответствие.Получить(Выборка.Ссылка); 
		ПВХОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ПриказыДоступныеДляФормирования() Экспорт
	
	МассивПриказов = Новый Массив;
	МассивПриказов.Добавить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2);
	МассивПриказов.Добавить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2);
	МассивПриказов.Добавить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2);
	МассивПриказов.Добавить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_ЕД715_1035);
	
	Возврат МассивПриказов; 
	
КонецФункции

Функция ФормыРеестраДоступнаДляВыгрузки() Экспорт
	
	РеестрыНДС0 = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений;
	
	МассивПриложений = Новый Массив;
	МассивПриложений.Добавить(РеестрыНДС0.РеестрНДС2021Кв2_Приложение07);
	МассивПриложений.Добавить(РеестрыНДС0.РеестрНДС2021Кв2_Приложение08);
	МассивПриложений.Добавить(РеестрыНДС0.РеестрНДС2021Кв2_Приложение09);
	МассивПриложений.Добавить(РеестрыНДС0.РеестрНДС2021Кв2_Приложение10);
	
	МассивПриложений.Добавить(РеестрыНДС0.РеестрНДС2024Кв2_Приложение06);
	МассивПриложений.Добавить(РеестрыНДС0.РеестрНДС2024Кв2_Приложение07);
	МассивПриложений.Добавить(РеестрыНДС0.РеестрНДС2024Кв2_Приложение08);
	МассивПриложений.Добавить(РеестрыНДС0.РеестрНДС2024Кв2_Приложение09);
	МассивПриложений.Добавить(РеестрыНДС0.РеестрНДС2024Кв2_Приложение10);
	МассивПриложений.Добавить(РеестрыНДС0.РеестрНДС2024Кв2_Приложение11);
	МассивПриложений.Добавить(РеестрыНДС0.РеестрНДС2024Кв2_Приложение12); 
	
	МассивПриложений.Добавить(РеестрыНДС0.РеестрНДС2025Кв2_Приложение06);

	МассивПриложений.Добавить(РеестрыНДС0.РеестрНДС2025Кв2_Приложение07);
	МассивПриложений.Добавить(РеестрыНДС0.РеестрНДС2025Кв2_Приложение08);
	МассивПриложений.Добавить(РеестрыНДС0.РеестрНДС2025Кв2_Приложение09);

	Возврат МассивПриложений; 
	
КонецФункции

//Приказ ФНС России от 23.10.2020 №ЕД-7-15/772@ 
Процедура ЗаполнитьЯчейкиПриложения07_РеестрНДС2021Кв2()
	
	ОписаниеЯчеек 	= ПолучитьОписанияЯчеек("РеестрНДС2021Кв2_РеестрНДСПриложение07"); 
	Родитель		= ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение07;
	
	ЗаполнитьЯчейкиОтчета(ОписаниеЯчеек, Родитель);
	
КонецПроцедуры   

Процедура ЗаполнитьЯчейкиПриложения08_РеестрНДС2021Кв2()
	
	ОписаниеЯчеек 	= ПолучитьОписанияЯчеек("РеестрНДС2021Кв2_РеестрНДСПриложение08"); 
	Родитель		= ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение08;
	
	ЗаполнитьЯчейкиОтчета(ОписаниеЯчеек, Родитель);
	
КонецПроцедуры  

Процедура ЗаполнитьЯчейкиПриложения09_РеестрНДС2021Кв2()
	
	ОписаниеЯчеек 	= ПолучитьОписанияЯчеек("РеестрНДС2021Кв2_РеестрНДСПриложение09"); 
	Родитель		= ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение09;
	
	ЗаполнитьЯчейкиОтчета(ОписаниеЯчеек, Родитель);
	
КонецПроцедуры    

Процедура ЗаполнитьЯчейкиПриложения10_РеестрНДС2021Кв2()
	
	ОписаниеЯчеек 	= ПолучитьОписанияЯчеек("РеестрНДС2021Кв2_РеестрНДСПриложение10"); 
	Родитель		= ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение10;
	
	ЗаполнитьЯчейкиОтчета(ОписаниеЯчеек, Родитель); 
	
	//ИспользуютсяДополнительныеСтроки
	Приложение10 = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение10.ПолучитьОбъект();
	Приложение10.ИспользуютсяДополнительныеСтроки = истина;
	Приложение10.Записать();
	
КонецПроцедуры   
//Приказ ФНС России от 23.10.2020 №ЕД-7-15/772@ 

//Приказ ФНС России от 14.03.2024 № ЕД-7-15/202@ 
Процедура ЗаполнитьЯчейкиРеестрНДС2024Кв2КНД_1155112()
	
	ОписаниеЯчеек 	= ПолучитьОписанияЯчеек("РеестрНДС2024Кв2_РеестрНДСПриложение07"); 
	Родитель		= ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение06;
	
	ЗаполнитьЯчейкиОтчета(ОписаниеЯчеек, Родитель);
	
КонецПроцедуры  

Процедура ЗаполнитьЯчейкиРеестрНДС2024Кв2КНД_1155113()

	ОписаниеЯчеек 	= ПолучитьОписанияЯчеек("РеестрНДС2021Кв2_РеестрНДСПриложение08"); 
	Родитель		= ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение07;
	
	ЗаполнитьЯчейкиОтчета(ОписаниеЯчеек, Родитель);
	
КонецПроцедуры   

Процедура ЗаполнитьЯчейкиРеестрНДС2024Кв2КНД_1155114()

	ОписаниеЯчеек 	= ПолучитьОписанияЯчеек("РеестрНДС2021Кв2_РеестрНДСПриложение09"); 
	Родитель		= ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение08;
	
	ЗаполнитьЯчейкиОтчета(ОписаниеЯчеек, Родитель);
	
КонецПроцедуры  

Процедура ЗаполнитьЯчейкиРеестрНДС2024Кв2КНД_1155115()

	ОписаниеЯчеек 	= ПолучитьОписанияЯчеек("РеестрНДС2024Кв2_РеестрНДСПриложение10"); 
	Родитель		= ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение09;
	
	ЗаполнитьЯчейкиОтчета(ОписаниеЯчеек, Родитель);
	
	//ИспользуютсяДополнительныеСтроки
	Приложение10 = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение09.ПолучитьОбъект();
	Приложение10.ИспользуютсяДополнительныеСтроки = истина;
	Приложение10.Записать();
	
КонецПроцедуры    

Процедура ЗаполнитьЯчейкиРеестрНДС2024Кв2КНД_1155122()
	
	ОписаниеЯчеек 	= ПолучитьОписанияЯчеек("РеестрНДС2024Кв2_РеестрНДСПриложение11"); 
	Родитель		= ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение10;
	
	ЗаполнитьЯчейкиОтчета(ОписаниеЯчеек, Родитель);

КонецПроцедуры  

Процедура ЗаполнитьЯчейкиРеестрНДС2024Кв2КНД_1155123()
	
	ОписаниеЯчеек 	= ПолучитьОписанияЯчеек("РеестрНДС2024Кв2_РеестрНДСПриложение12"); 
	Родитель		= ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение11;
	
	ЗаполнитьЯчейкиОтчета(ОписаниеЯчеек, Родитель);

КонецПроцедуры  

Процедура ЗаполнитьЯчейкиРеестрНДС2024Кв2КНД_1155116()
	
	ОписаниеЯчеек 	= ПолучитьОписанияЯчеек("РеестрНДС2024Кв2_РеестрНДСПриложение13"); 
	Родитель		= ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение12;
	
	ЗаполнитьЯчейкиОтчета(ОписаниеЯчеек, Родитель);
	
КонецПроцедуры  
//Приказ ФНС России от 14.03.2024 № ЕД-7-15/202@

//Приказ ФНС России от 15.11.2024 №ЕД-7-15/1036@
Процедура ЗаполнитьЯчейкиРеестрНДС2025Кв2КНД_1155112()
	
	ОписаниеЯчеек 	= ПолучитьОписанияЯчеек("РеестрНДС2025Кв2_РеестрНДСПриложение07"); 
	Родитель		= ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение06;
	
	ЗаполнитьЯчейкиОтчета(ОписаниеЯчеек, Родитель);
	
	//ИспользуютсяДополнительныеСтроки
	Приложение06 = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение06.ПолучитьОбъект();
	Приложение06.ИспользуютсяДополнительныеСтроки = Истина;
	Приложение06.Записать();
	
КонецПроцедуры  
//Приказ ФНС России от 15.11.2024 №ЕД-7-15/1036@

//Приказ ФНС России от 15.11.2024 №ЕД-7-15/1035@ 
Процедура ЗаполнитьЯчейкиРеестрНДС2025Кв2_ЕД715_1035КНД_1155113()

	ОписаниеЯчеек 	= ПолучитьОписанияЯчеек("РеестрНДС2021Кв2_РеестрНДСПриложение08"); 
	Родитель		= ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение07;
	
	ЗаполнитьЯчейкиОтчета(ОписаниеЯчеек, Родитель);
	
КонецПроцедуры   

Процедура ЗаполнитьЯчейкиРеестрНДС2025Кв2_ЕД715_1035КНД_1155114()

	ОписаниеЯчеек 	= ПолучитьОписанияЯчеек("РеестрНДС2021Кв2_РеестрНДСПриложение09"); 
	Родитель		= ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение08;
	
	ЗаполнитьЯчейкиОтчета(ОписаниеЯчеек, Родитель);
	
КонецПроцедуры  

Процедура ЗаполнитьЯчейкиРеестрНДС2025Кв2_ЕД715_1035КНД_1155115()

	ОписаниеЯчеек 	= ПолучитьОписанияЯчеек("РеестрНДС2024Кв2_РеестрНДСПриложение10"); 
	Родитель		= ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение09;
	
	ЗаполнитьЯчейкиОтчета(ОписаниеЯчеек, Родитель);
	
	//ИспользуютсяДополнительныеСтроки
	Приложение10 = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение09.ПолучитьОбъект();
	Приложение10.ИспользуютсяДополнительныеСтроки = истина;
	Приложение10.Записать();
	
КонецПроцедуры    
//Приказ ФНС России от 15.11.2024 №ЕД-7-15/1035@

Процедура ЗаполнитьЯчейкиОтчета(Знач ОписаниеЯчеек, Знач Родитель)
	
	Для Каждого СтрокаОписания из ОписаниеЯчеек Цикл 
		
		НайденнаяСсылка = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.НайтиПоРеквизиту("ИмяЯчейки",СтрокаОписания.ИмяЯчейки, Родитель);  
		Если НайденнаяСсылка.Пустая() Тогда
			ОписаниеЯчейки = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.СоздатьЭлемент();  
		Иначе
			ОписаниеЯчейки = НайденнаяСсылка.ПолучитьОбъект();  
		КонецЕсли;
		
		ОписаниеЯчейки.Родитель 				= Родитель;
		ОписаниеЯчейки.Наименование				= СтрокаОписания.Наименование;
		ОписаниеЯчейки.ИмяГруппы 				= СтрокаОписания.ИмяГруппы;
		ОписаниеЯчейки.ИмяЯчейки 				= СтрокаОписания.ИмяЯчейки;
		ОписаниеЯчейки.НомерКолонки 			= СтрокаОписания.НомерКолонки;
		ОписаниеЯчейки.ТипЗначения  			= СтрокаОписания.Тип;  
		ОписаниеЯчейки.ЯчейкаНумерации 			= СтрокаОписания.Нумерация;
		ОписаниеЯчейки.ЯчейкаНалоговаяБаза 		= СтрокаОписания.НалоговаяБаза;  
		ОписаниеЯчейки.ЯчейкаПримечание 		= СтрокаОписания.Примечание; 
		ОписаниеЯчейки.КонтролироватьЗаполнение = СтрокаОписания.КонтролироватьЗаполнение; 
		
		
		ОписаниеЯчейки.Записать();
	КонецЦикла;

КонецПроцедуры 

Функция ПолучитьОписанияЯчеек(ИмяМакета)        
	
	ОписаниеЯчеек = Новый ТаблицаЗначений;
	ОписаниеЯчеек.Колонки.Добавить("НомерКолонки", 	Новый ОписаниеТипов("Число"));
	ОписаниеЯчеек.Колонки.Добавить("ИмяГруппы", 	Новый ОписаниеТипов("Строка"));
	ОписаниеЯчеек.Колонки.Добавить("ИмяЯчейки", 	Новый ОписаниеТипов("Строка"));
	ОписаниеЯчеек.Колонки.Добавить("Тип");
	ОписаниеЯчеек.Колонки.Добавить("НалоговаяБаза", Новый ОписаниеТипов("Булево"));
	ОписаниеЯчеек.Колонки.Добавить("Нумерация", 	Новый ОписаниеТипов("Булево"));   
	ОписаниеЯчеек.Колонки.Добавить("Примечание", 	Новый ОписаниеТипов("Булево"));   
	ОписаниеЯчеек.Колонки.Добавить("КонтролироватьЗаполнение", 	Новый ОписаниеТипов("Булево"));
	ОписаниеЯчеек.Колонки.Добавить("Наименование",  Новый ОписаниеТипов("Строка"));
	
	Макет = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.ПолучитьМакет(ИмяМакета);
	
	ВысотаТаблицы = Макет.ВысотаТаблицы;
	
	//1 - Номер колонки	
	//2 - Раздел
	//3 - Ключ	
	//4 - Тип	   
	//5 - Налоговая база	
	//6 - Нумерация  
	//7 - ОбязательноДляЗаполнения  
	//8 - Наименование  
	
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		
		НоваяСтрока = ОписаниеЯчеек.Добавить();
		
		НоваяСтрока.НомерКолонки 	= Число(Макет.Область(НомерСтроки, 1, НомерСтроки, 1).Текст);
		НоваяСтрока.ИмяГруппы 		= СокрЛП(Макет.Область(НомерСтроки, 2, НомерСтроки, 2).Текст);
		НоваяСтрока.ИмяЯчейки 		= СокрЛП(Макет.Область(НомерСтроки, 3, НомерСтроки, 3).Текст); 
		
		Тип = СокрЛП(Макет.Область(НомерСтроки, 4, НомерСтроки, 4).Текст);	
		Если Тип = "Строка" или Тип = "Булево" Тогда
			НоваяСтрока.Тип = Новый ОписаниеТипов(Тип);
		КонецЕсли;
		Если Тип = "Дата" Тогда
			НоваяСтрока.Тип = Новый ОписаниеТипов(Тип,,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата));
		КонецЕсли;
		Если Тип = "Число" Тогда
			НоваяСтрока.Тип = Новый ОписаниеТипов(Тип,,,Новый КвалификаторыЧисла(16,2));
		КонецЕсли;
		
		НалоговаяБаза 	= СокрЛП(Макет.Область(НомерСтроки, 5, НомерСтроки, 5).Текст);	
		НоваяСтрока.НалоговаяБаза = ?(НалоговаяБаза = "+", Истина, Ложь);
			
		Нумерация 	= СокрЛП(Макет.Область(НомерСтроки, 6, НомерСтроки, 6).Текст);	
		НоваяСтрока.Нумерация = ?(Нумерация = "+", Истина, Ложь);
		
		Примечание 	= СокрЛП(Макет.Область(НомерСтроки, 7, НомерСтроки, 7).Текст);	
		НоваяСтрока.Примечание = ?(Примечание = "+", Истина, Ложь);
		
		КонтролироватьЗаполнение 	= СокрЛП(Макет.Область(НомерСтроки, 8, НомерСтроки, 8).Текст);	
		НоваяСтрока.КонтролироватьЗаполнение = ?(КонтролироватьЗаполнение = "+", Истина, Ложь);

		НоваяСтрока.Наименование 	= СокрЛП(Макет.Область(НомерСтроки, 9, НомерСтроки, 9).Текст);   
		
	КонецЦикла;	
	
	Возврат ОписаниеЯчеек;
	
КонецФункции
	
Функция ВыполнитьНастройкиМониторинговыхПарамтеров() Экспорт
	
	ТипЗначенияПараметра = Тип("ПеречислениеСсылка.CW_РеестрыНДС0Приложения");
	мПараметры 		= ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ПолучитьСписокПараметровПоТипуЗначения(ТипЗначенияПараметра);
	Если мПараметры.Количество() > 0 Тогда
		Возврат мПараметры[0];
	КонецЕсли;                       
	
	Мониторинговыйпараметр = ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.СоздатьЭлемент();
	Мониторинговыйпараметр.Наименование 						= "Приложение реестра по НДС";
	Мониторинговыйпараметр.ТипЗначения  						= Новый ОписаниеТипов("ПеречислениеСсылка.CW_РеестрыНДС0Приложения");
	Мониторинговыйпараметр.ПрямоеРедактирование  				= Истина;
	Мониторинговыйпараметр.МножественноеПрямоеРедактирование  	= Истина;
	Мониторинговыйпараметр.ИспользоватьФормуВыбораОбъекта  		= Истина;

	Мониторинговыйпараметр.ДополнительныеСвойства.Вставить("ЭтоНовый", Истина);

	Мониторинговыйпараметр.Записать();   
	
	Возврат Мониторинговыйпараметр.Ссылка;
	
КонецФункции

Функция ПолучитьСписокПриказов() Экспорт

	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2);
	СписокЗначений.Добавить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2);
 	СписокЗначений.Добавить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2);
 	СписокЗначений.Добавить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_ЕД715_1035);

	Возврат СписокЗначений; 
	
КонецФункции  

Функция ПолучитьСписокПриложенийПоПриказу(ПриказФНС) Экспорт
	
	СписокЗначений = Новый СписокЗначений;

	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РеестрыНДС0ЯчейкиПриложений.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений КАК CW_РеестрыНДС0ЯчейкиПриложений
	               |ГДЕ
	               |	CW_РеестрыНДС0ЯчейкиПриложений.Родитель = &ПриказФНС
	               |	И CW_РеестрыНДС0ЯчейкиПриложений.ЭтоГруппа = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка
	               |АВТОУПОРЯДОЧИВАНИЕ";  
	
	Запрос.УстановитьПараметр("ПриказФНС", ПриказФНС);
	
	РезультатЗапрсоа = Запрос.Выполнить();
	
	Выборка = РезультатЗапрсоа.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокЗначений.Добавить(Выборка.Ссылка);	
	КонецЦикла;
	
	Возврат СписокЗначений;  
	
КонецФункции    

Функция ПолучитьСписокВидовТранспортаПоПриказу(ПриказФНС) Экспорт
	
	Массив = Новый Массив;

	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РеестрыНДС0ЯчейкиПриложений.ПриложениеПоВидуТранспорта КАК ВидТранспота
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений КАК CW_РеестрыНДС0ЯчейкиПриложений
	               |ГДЕ
	               |	CW_РеестрыНДС0ЯчейкиПриложений.Родитель = &ПриказФНС
	               |	И CW_РеестрыНДС0ЯчейкиПриложений.ЭтоГруппа = ИСТИНА
	               |АВТОУПОРЯДОЧИВАНИЕ";  
	
	Запрос.УстановитьПараметр("ПриказФНС", ПриказФНС);
	
	РезультатЗапрсоа = Запрос.Выполнить();
	
	Выборка = РезультатЗапрсоа.Выбрать();
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Выборка.ВидТранспота);	
	КонецЦикла;
	
	Возврат Массив;  
	
КонецФункции

Функция СоответствияВидаТранспортаПоПриказам() Экспорт
	
	ПриказФНС = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений;

	СоответствиеРеестрНДС2021Кв2 = ПолучитьСоответствиеВидаТранспортаПриложению(ПриказФНС.РеестрНДС2021Кв2);
  	СоответствиеРеестрНДС2024Кв2 = ПолучитьСоответствиеВидаТранспортаПриложению(ПриказФНС.РеестрНДС2024Кв2);
	СоответствиеРеестрНДС2025Кв2 = ПолучитьСоответствиеВидаТранспортаПриложению(ПриказФНС.РеестрНДС2025Кв2);
	СоответствиеРеестрНДС2025Кв2_ЕД715_1035 = ПолучитьСоответствиеВидаТранспортаПриложению(ПриказФНС.РеестрНДС2025Кв2_ЕД715_1035);
	
	Соответствие = Новый Соответствие;   
	Соответствие.Вставить(ПриказФНС.РеестрНДС2021Кв2,  СоответствиеРеестрНДС2021Кв2);
	Соответствие.Вставить(ПриказФНС.РеестрНДС2024Кв2,  СоответствиеРеестрНДС2024Кв2);
	Соответствие.Вставить(ПриказФНС.РеестрНДС2025Кв2,  СоответствиеРеестрНДС2025Кв2);
	Соответствие.Вставить(ПриказФНС.РеестрНДС2025Кв2_ЕД715_1035, СоответствиеРеестрНДС2025Кв2_ЕД715_1035);

	Возврат Соответствие;  
	
КонецФункции

Функция ПолучитьСоответствиеВидаТранспортаПриложению(ПриказФНС)
	
	Соответствие = Новый Соответствие;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_РеестрыНДС0ЯчейкиПриложений.Ссылка КАК Ссылка,
	|	CW_РеестрыНДС0ЯчейкиПриложений.ПриложениеПоВидуТранспорта КАК ВидТранспорта
	|ИЗ
	|	ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений КАК CW_РеестрыНДС0ЯчейкиПриложений
	|ГДЕ
	|	CW_РеестрыНДС0ЯчейкиПриложений.Родитель = &ПриказФНС
	|	И CW_РеестрыНДС0ЯчейкиПриложений.ЭтоГруппа = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";  
	
	Запрос.УстановитьПараметр("ПриказФНС", ПриказФНС);
	
	РезультатЗапрсоа = Запрос.Выполнить();
	
	Выборка = РезультатЗапрсоа.Выбрать();
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.ВидТранспорта, Выборка.Ссылка);	
	КонецЦикла;
	Возврат Соответствие;

КонецФункции   

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы <> "ФормаГруппы" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ВыбраннаяФорма = "ФормаГруппы";
	
	СписокПриказов = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.ПолучитьСписокПриказов();
	Приказы = СписокПриказов.ВыгрузитьЗначения();
	
	Если Параметры.Свойство("Ключ") Тогда
		
		Если ЗначениеЗаполнено(Параметры.Ключ) Тогда  
			Если Приказы.Найти(Параметры.Ключ) = Неопределено Тогда
				ВыбраннаяФорма = "ФормаПриложения";
			Иначе
				ВыбраннаяФорма = "ФормаПриказа";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
